export const NUNGIL =
  "직장인 소개팅 서비스 눈길은 제한된 직장가 내 장소와 시간을 추천해주는 오프라인 커피챗을 제공함으로서 신뢰성 있는 만남을 제공하는 웹 서비스입니다. 소개팅 서비스 시장에 대한 수요가 끊이지 않는 상황에서 만남에 대한 사용자의 부담을 최소한으로 줄이자는 목표에서 시작된 프로젝트입니다.\n\n디자이너 1명과 프론트엔드 개발자 2명, 백엔드 개발자 2명으로 구성되었으며 기획은 다 함께 진행했습니다. 해당 프로젝트를 통해 첫 장기 프로젝트 경험을 가져갈 수 있었을 뿐만 아니라 협업 및 리액트에 대해 깊이 이해할 수 있던 계기가 되었습니다.\n\n여러 컴포넌트 및 페이지들이 존재했기에, 그에 따라 발생하는 렌더링 이슈들을 겪으며 성능을 최적화하기 위해 효율적으로 아키텍처를 설계하고 컴포넌트를 최적화하고자 노력했습니다.\n\n지난 5월 실 사용자를 받아보는 경험을 통해 받은 피드백을 토대로 기획을 재정비했습니다. 현재는 React Native를 통한 앱 개발 진행 중에 있으며, 푸시 알림을 직접 개발해보는 등 앱에서만 지원되는 기능들을 개발 중에 있습니다.";

export const LIKELION =
  "멋쟁이사자처럼 숭실대 12기 리쿠르팅을 위해 제작된 웹사이트입니다.\n\n학생들이 여러 종류의 기기로 접속할 것을 고려해 반응형으로 제작된 사이트입니다. 제가 맡았던 페이지 내에서 Framer 라이브러리를 활용해 컴포넌트 단위로 손쉽게 애니메이션을 적용할 수 있었습니다. 이를 통해 사용자 경험 및 유저 인터렉션의 퀄리티를 향상시킬 수 있었습니다.\n\nVercel을 통해 배포한 후 도메인 연결을 완료해 실시간으로 해당 웹사이트 서비스가 가능하게끔 하였습니다.";

export const GILJOBE =
  "길JOB이는 청년 일자리 정책을 한 눈에 보기 쉽도록 제공함으로서 청년 정책 가이드 역할을 수행하는 서비스입니다. 청년들의 일자리와 관련된 디지털 격차를 해소하고자 고안된 프로젝트입니다.\n\n접근성을 향상시키기 위해 웹 기반으로 개발되었으며, 다양한 디바이스에서 최적의 사용자 경험을 제공하기 위해 반응형 웹으로 진행되었습니다. 프로젝트를 진행하면서 반응형 웹을 직접 설계하고 구현하는 과정을 통해 다양한 화면 크기에 적합한 UI를 구축하는 경험을 가져갈 수 있었습니다.\n\n또한, Vercel을 통한 프론트엔드 배포를 처음으로 경험하며 실제 서비스 배포의 과정을 이해할 수 있었습니다.";

export const GITHUB = "소스 코드 저장소입니다.";

export const VELOG = "공부한 내용들을 정리하고 기록하는 블로그입니다.";

export const PORTFOLIO =
  "현재 보고계신 포트폴리오 사이트입니다.\n\n추후 현재 진행 중인 장기 프로젝트에 대한 상세 포트폴리오 파일도 첨부할 예정입니다.";
